In [1]:
#Write a function to add elements in a tuple
def add(tup):
    print("Sum of elements in tuple is",sum(list(tup)))
    
no = (1,2,3,4,5)    
add(no)

Sum of elements in tuple is 15

In [2]:
l1=[1,2,3,4,5]
l2=[6,7,8,9,10]
l3=(list(zip(l1,l2)))
l3.sort(key = lambda x: x[1])
print("according second element")
print(l3)
print("according first element")
l3.sort()
print(l3)

according second element
[(1, 6), (2, 7), (3, 8), (4, 9), (5, 10)]
according first element
[(1, 6), (2, 7), (3, 8), (4, 9), (5, 10)]

In [3]:
file = open("new12.txt",'r')
try:
    file.write("First line of file")
except :
    print("File not writable")

FileNotFoundError: [Errno 2] No such file or directory: 'new12.txt'

In [ ]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

In [21]:
""""Qno- By importing required module create a dataframe.Display the dataframe {'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,
2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,
25000, 10000, 46000,
31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai',
'Delhi', 'Mumbai', 'Delhi',
'Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,
29, 24, 21, 24]}

After creating perform the following set of questions:- 1.selecting cars with brand 'Maruti' and Mileage > 25 2.selecting range of rows from 2 to 5 3.updating values of Mileage if Year < 2015 4.selecting 0th, 2th, 4th, and 7th index rows 5.selecting rows from 1 to 4 and columns from 2 to 4"""

import pandas as pd
import numpy as np

data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,25000, 10000, 46000,31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai','Delhi', 'Mumbai', 'Delhi','Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]})

In [6]:
data.loc[(data["Brand"] == 'Maruti') & (data["Mileage"] > 25)]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [7]:
data.loc[2:5]

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [8]:
data.loc[(data.Year<2015), ['Mileage']] = 47
data

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       47
1   Hyundai  2014       30000      Delhi       47
2      Tata  2011       60000     Mumbai       47
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       47
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       47
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [9]:
data.iloc[[0,2,4,7]]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       47
2    Tata  2011       60000   Mumbai       47
4  Maruti  2012       10000   Mumbai       47
7    Tata  2018       15000  Chennai       21

In [10]:
data.iloc[1:5,2:5]

   Kms Driven    City  Mileage
1       30000   Delhi       47
2       60000  Mumbai       47
3       25000   Delhi       26
4       10000  Mumbai       47

In [28]:
""""
Qno-By importing required module create a dataframe.Display the dataframe {'age':[30, 2, 12, 4, 32, 33, 69], 'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 'height':[165, 70, 120, 80, 180, 172, 150], 'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'] *After creating perform the following set of questions:- 1.selecting column penelope 2.selecting columns cornelia,jane,dean 3.selecting columns from aaron upto dean 4.selecting 4th index column 5.selecting rows from 1 to 4 and 2nd column
"""

'"\nQno-By importing required module create a dataframe.Display the dataframe {\'age\':[30, 2, 12, 4, 32, 33, 69], \'color\':[\'blue\', \'green\', \'red\', \'white\', \'gray\', \'black\', \'red\'], \'food\':[\'Steak\', \'Lamb\', \'Mango\', \'Apple\', \'Cheese\', \'Melon\', \'Beans\'], \'height\':[165, 70, 120, 80, 180, 172, 150], \'score\':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], \'state\':[\'NY\', \'TX\', \'FL\', \'AL\', \'AK\', \'TX\', \'TX\'] }, index=[\'Jane\', \'Nick\', \'Aaron\', \'Penelope\', \'Dean\', \'Christina\', \'Cornelia\'] *After creating perform the following set of questions:- 1.selecting column penelope 2.selecting columns cornelia,jane,dean 3.selecting columns from aaron upto dean 4.selecting 4th index column 5.selecting rows from 1 to 4 and 2nd column\n'

In [29]:
data1 = pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69], 
                      'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'], 
                      'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'], 
                      'height':[165, 70, 120, 80, 180, 172, 150], 'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 
                      'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX'] }, 
                     index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'])
display(data1)

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [32]:
data1.loc[['Penelope']]

          age  color   food  height  score state
Penelope    4  white  Apple      80    3.3    AL

In [33]:
data1.loc[['Cornelia', 'Jane', 'Dean']]

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [34]:
data1.loc['Aaron':'Dean']

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

In [35]:
data1.iloc[[4]]

      age color    food  height  score state
Dean   32  gray  Cheese     180    1.8    AK

In [36]:
data1.iloc[1:4,[2]]

           food
Nick       Lamb
Aaron     Mango
Penelope  Apple